-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Apr 25, 2026 at 01:14 PM
-- Server version: 8.0.30
-- PHP Version: 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `pharmacy_mohamed_pharm`
--

-- --------------------------------------------------------

--
-- Table structure for table `branches`
--

CREATE TABLE `branches` (
  `id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `branch_number` int NOT NULL,
  `name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `city` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` enum('active','inactive') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'active'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `branches`
--

INSERT INTO `branches` (`id`, `branch_number`, `name`, `city`, `status`) VALUES
('br-001', 1, 'الفرع الرئيسي', 'غزة', 'active'),
('br-002', 2, 'فرع المدرسة', 'غزة', 'active'),
('br-003', 3, 'فرع المواصي', 'الوسطى', 'active');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`) VALUES
('cat-drops', 'قطرات وبخاخات'),
('cat-inject', 'حقن وأمبولات'),
('cat-liquids', 'شرابات ومعلقات'),
('cat-other', 'أصناف متنوعة'),
('cat-solid', 'أقراص وكبسولات'),
('cat-supp', 'تحاميل'),
('cat-supplies', 'مستلزمات وعناية'),
('cat-topical', 'كريمات وجل ومراهم');

-- --------------------------------------------------------

--
-- Table structure for table `debts`
--

CREATE TABLE `debts` (
  `id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `customer_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `amount` decimal(10,2) NOT NULL,
  `invoice_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `branch_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` enum('pending','paid') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'pending',
  `notes` text COLLATE utf8mb4_unicode_ci,
  `created_at` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(200) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `base_unit` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `purchase_price` decimal(10,2) NOT NULL,
  `wholesale_price` decimal(10,2) NOT NULL DEFAULT '0.00',
  `sale_price` decimal(10,2) NOT NULL,
  `stock_qty` decimal(10,2) NOT NULL DEFAULT '0.00',
  `low_stock_threshold` decimal(10,2) NOT NULL DEFAULT '0.00',
  `expiry_date` date DEFAULT NULL,
  `branch_id` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `supplier_name` varchar(150) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `notes` text COLLATE utf8mb4_unicode_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `name`, `category_id`, `base_unit`, `purchase_price`, `wholesale_price`, `sale_price`, `stock_qty`, `low_stock_threshold`, `expiry_date`, `branch_id`, `supplier_name`, `notes`) VALUES
('prd-wh-0001', 'panthenol 2% cream', 'cat-topical', 'أنبوب', '12.00', '10.00', '15.00', '59.00', '8.00', '2028-06-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0002', 'fast freeze gel', 'cat-topical', 'أنبوب', '22.00', '18.00', '25.00', '5.00', '2.00', '2028-09-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0003', 'quadriderm cream', 'cat-topical', 'أنبوب', '9.00', '8.00', '10.00', '210.00', '20.00', '2028-12-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0004', 'Pentaburn oin', 'cat-topical', 'أنبوب', '10.00', '8.00', '15.00', '26.00', '5.00', '2027-12-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0005', 'fudion cream', 'cat-topical', 'أنبوب', '7.00', '6.00', '10.00', '16.00', '3.00', '2026-06-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0006', 'sediproct cream', 'cat-topical', 'أنبوب', '13.00', '11.00', '15.00', '35.00', '5.00', '2027-11-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0007', 'dr wound 30g gel', 'cat-topical', 'أنبوب', '10.00', '6.00', '15.00', '22.00', '5.00', '2026-10-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0008', 'dr wound 15g gel', 'cat-topical', 'أنبوب', '5.00', '4.00', '10.00', '92.00', '12.00', '2026-10-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0009', 'Mebo 30g cr', 'cat-topical', 'أنبوب', '23.00', '20.00', '30.00', '16.00', '3.00', '2027-11-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0010', 'collomak sol.', 'cat-topical', 'أنبوب', '7.00', '6.00', '10.00', '184.00', '20.00', '2029-08-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0011', 'diprosalic lotion', 'cat-topical', 'أنبوب', '15.00', '13.00', '20.00', '40.00', '8.00', '2027-10-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0012', 'skinoren cream', 'cat-topical', 'أنبوب', '28.00', '23.00', '50.00', '176.00', '20.00', '2028-03-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0013', 'vagiclind 2% cream', 'cat-topical', 'أنبوب', '20.00', '18.00', '25.00', '63.00', '8.00', '2027-08-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0014', 'azaderm 20% cream', 'cat-topical', 'أنبوب', '12.00', '10.00', '15.00', '28.00', '5.00', '2028-01-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0015', 'isoromyderm gel', 'cat-topical', 'أنبوب', '18.00', '16.00', '25.00', '84.00', '12.00', '2028-07-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0016', 'neomycin + zinc cr 30g', 'cat-topical', 'أنبوب', '13.00', '9.00', '17.00', '192.00', '20.00', '2028-01-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0017', 'dermatin 14g cr', 'cat-topical', 'أنبوب', '13.00', '11.00', '115.00', '4.00', '2.00', '2027-08-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0018', 'zovirax 5% cream', 'cat-topical', 'أنبوب', '10.00', '9.00', '15.00', '20.00', '5.00', '2027-10-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0019', 'acyclovir 5% cream', 'cat-topical', 'أنبوب', '14.00', '12.00', '18.00', '1.00', '2.00', '2028-06-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0020', 'ultracain 30g gel', 'cat-topical', 'أنبوب', '12.00', '10.00', '15.00', '6.00', '2.00', '2027-07-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0021', 'garamycin 15g cream', 'cat-topical', 'أنبوب', '10.00', '9.00', '15.00', '4.00', '2.00', '2028-10-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0022', 'scaro cr', 'cat-topical', 'أنبوب', '60.00', '55.00', '75.00', '2.00', '2.00', '2028-09-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0023', 'elicasal 30g cream', 'cat-topical', 'أنبوب', '10.00', '9.00', '15.00', '86.00', '12.00', '2027-07-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0024', 'oracure oral gel', 'cat-topical', 'أنبوب', '9.00', '8.00', '15.00', '13.00', '3.00', '2028-10-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0025', 'fucidin 15g cream مصري', 'cat-topical', 'أنبوب', '12.00', '10.00', '15.00', '121.00', '12.00', '2028-08-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0026', 'fucicort 15g cream مصري', 'cat-topical', 'أنبوب', '13.00', '9.00', '17.00', '584.00', '20.00', '2028-09-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0027', 'fucicort 20g cream مصري', 'cat-topical', 'أنبوب', '18.00', '16.00', '20.00', '54.00', '8.00', '2028-09-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0028', 'fucicort 15g cream أجنبي', 'cat-topical', 'أنبوب', '21.00', '19.00', '25.00', '49.00', '8.00', '2026-05-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0029', 'miconaz oral gel', 'cat-topical', 'أنبوب', '7.00', '6.00', '10.00', '312.00', '20.00', '2029-09-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0030', 'borgasone 20g cream', 'cat-topical', 'أنبوب', '12.00', '10.00', '15.00', '44.00', '8.00', '2028-09-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0031', 'contractubex 20g gel', 'cat-topical', 'أنبوب', '23.00', '21.00', '30.00', '47.00', '8.00', '2028-10-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0032', 'acretin 0.025% cream', 'cat-topical', 'أنبوب', '13.00', '10.50', '15.00', '30.00', '5.00', '2027-05-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0033', 'acretin 0.05% cream', 'cat-topical', 'أنبوب', '13.00', '11.50', '15.00', '13.00', '3.00', '2026-11-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0034', 'vimto 50g gel', 'cat-topical', 'أنبوب', '10.00', '9.00', '15.00', '9.00', '2.00', '2028-05-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0035', 'propamethon cream 20g', 'cat-topical', 'أنبوب', '9.00', '8.00', '15.00', '67.00', '8.00', '2027-11-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0036', 'fusizon 15g cream', 'cat-topical', 'أنبوب', '12.00', '10.00', '15.00', '59.00', '8.00', '2028-02-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0037', 'fuci 15g cream', 'cat-topical', 'أنبوب', '9.00', '8.00', '13.00', '135.00', '12.00', '2028-01-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0038', 'fuci 30g cream', 'cat-topical', 'أنبوب', '12.00', '10.00', '15.00', '670.00', '20.00', '2028-10-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0039', 'moov massage gel', 'cat-topical', 'أنبوب', '12.00', '10.00', '15.00', '13.00', '3.00', '2028-08-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0040', 'panderm 30g cream', 'cat-topical', 'أنبوب', '15.00', '12.00', '20.00', '30.00', '5.00', '2026-08-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0041', 'rubalgine gel', 'cat-topical', 'أنبوب', '14.00', '12.50', '20.00', '60.00', '8.00', '2027-01-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0042', 'momenta cr', 'cat-topical', 'أنبوب', '18.00', '16.00', '23.00', '58.00', '8.00', '2027-09-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0043', 'knife مشرط طبي 100قطعة', 'cat-supplies', 'قطعة', '50.00', '45.00', '100.00', '33.00', '5.00', '2027-01-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0044', 'dermovate cr', 'cat-topical', 'أنبوب', '11.00', '10.00', '15.00', '14.00', '3.00', '2027-07-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0045', 'dermovate oint', 'cat-topical', 'أنبوب', '11.00', '10.00', '15.00', '224.00', '20.00', '2027-03-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0046', 'نيدل 23 اخضر', 'cat-other', 'علبة', '15.00', '10.00', '20.00', '3.00', '2.00', '2026-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0047', 'صابونة الكبريت', 'cat-other', 'علبة', '10.00', '9.00', '15.00', '0.00', '2.00', '2029-10-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0048', 'calamine soap صابونة الكالامين', 'cat-supplies', 'قطعة', '10.00', '9.00', '15.00', '4.00', '2.00', '2028-05-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0049', 'collagen + c soap صابونة الكولاجين مع فيتامين سي', 'cat-supplies', 'قطعة', '20.00', '18.00', '25.00', '70.00', '8.00', '2028-08-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0050', 'licorice soap صابونة عرق السوس', 'cat-supplies', 'قطعة', '20.00', '18.00', '25.00', '2.00', '2.00', '2028-04-19', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0051', 'collagen soap صابونة الكولاجين', 'cat-supplies', 'قطعة', '20.00', '18.00', '25.00', '22.00', '5.00', '2028-04-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0052', 'papaya soap صابونة البابايا', 'cat-supplies', 'قطعة', '20.00', '18.00', '25.00', '13.00', '3.00', '2027-08-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0053', 'kenacomb cr', 'cat-topical', 'أنبوب', '8.00', '6.00', '10.00', '698.00', '20.00', '2026-09-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0054', 'diltiarecat 2% 30g cr', 'cat-topical', 'أنبوب', '21.00', '19.00', '30.00', '62.00', '8.00', '2027-08-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0055', 'Adapalene gel', 'cat-topical', 'أنبوب', '9.00', '8.00', '15.00', '151.00', '20.00', '2028-09-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0056', 'عازل طبي اطعم 3قطع', 'cat-other', 'علبة', '5.00', '4.50', '6.00', '170.00', '20.00', '2027-09-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0057', 'كمامات اسود 50قطعة', 'cat-other', 'علبة', '10.00', '8.00', '15.00', '14.00', '3.00', '2027-01-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0058', 'لهاية سلسلة algo 1قطعة', 'cat-other', 'علبة', '3.00', '2.50', '5.00', '272.00', '20.00', '2027-01-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0059', 'غيار رضاعة مرطبان 36قطعة', 'cat-other', 'علبة', '32.00', '28.00', '64.00', '47.00', '8.00', '2027-01-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0060', 'غيار رضاعة مرطبان 100قطعة', 'cat-other', 'علبة', '95.00', '85.00', '200.00', '1.00', '2.00', '2027-01-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0061', 'manovapracain spray', 'cat-topical', 'أنبوب', '8.00', '6.00', '10.00', '440.00', '20.00', '2024-02-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0062', 'bronchicum syr', 'cat-liquids', 'زجاجة', '13.00', '11.00', '15.00', '122.00', '12.00', '2027-09-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0063', 'flagyl 125mg susp', 'cat-liquids', 'زجاجة', '9.00', '8.00', '15.00', '135.00', '12.00', '2028-10-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0064', 'newclav 400mg susp', 'cat-liquids', 'زجاجة', '17.00', '15.00', '20.00', '82.00', '12.00', '2027-04-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0065', 'newclav 600mg susp', 'cat-liquids', 'زجاجة', '17.00', '15.00', '20.00', '79.00', '8.00', '2027-03-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0066', 'Osteocare syr', 'cat-liquids', 'زجاجة', '20.00', '18.00', '25.00', '63.00', '8.00', '2027-11-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0067', 'megamox 228.5mg susp', 'cat-liquids', 'زجاجة', '12.00', '10.00', '17.00', '71.00', '8.00', '2027-08-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0068', 'zyrtec syr', 'cat-liquids', 'زجاجة', '12.00', '10.00', '15.00', '101.00', '12.00', '2028-05-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0069', 'amoxicillin and cavanate 312.5mg susp', 'cat-liquids', 'زجاجة', '15.00', '12.00', '17.00', '9.00', '2.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0070', 'maxical syr', 'cat-liquids', 'زجاجة', '13.00', '10.00', '20.00', '60.00', '8.00', '2027-10-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0071', 'predsol syr', 'cat-liquids', 'زجاجة', '12.00', '10.00', '9.00', '32.00', '5.00', '2028-08-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0072', 'remedol syr acamol', 'cat-liquids', 'زجاجة', '10.00', '9.00', '15.00', '27.00', '5.00', '2027-06-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0073', 'feroglobin b12 syr', 'cat-liquids', 'زجاجة', '18.00', '16.00', '25.00', '5.00', '2.00', '2027-05-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0074', 'duphalac syrup', 'cat-liquids', 'زجاجة', '22.00', '22.00', '25.00', '74.00', '8.00', '2028-03-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0075', 'nanazoxid syr', 'cat-liquids', 'زجاجة', '10.00', '9.00', '15.00', '190.00', '20.00', '2028-06-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0076', 'cetafen n syr', 'cat-liquids', 'زجاجة', '8.00', '7.00', '10.00', '583.00', '20.00', '2027-03-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0077', 'vi drop', 'cat-drops', 'عبوة', '9.00', '7.00', '10.00', '240.00', '20.00', '2028-01-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0078', 'diviton D drop', 'cat-drops', 'عبوة', '9.00', '8.00', '15.00', '160.00', '20.00', '2028-10-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0079', 'enemax enema', 'cat-other', 'علبة', '13.00', '13.00', '15.00', '20.00', '5.00', '2028-08-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0080', 'cervetoka syr fortamend', 'cat-liquids', 'زجاجة', '23.00', '20.00', '25.00', '9.00', '2.00', '2024-02-24', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0081', 'total syr', 'cat-liquids', 'زجاجة', '17.00', '17.00', '25.00', '40.00', '8.00', '2027-02-24', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0082', 'cal mag forte syr', 'cat-liquids', 'زجاجة', '20.00', '19.00', '25.00', '9.00', '2.00', '2026-11-24', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0083', 'binozyt 200mg 30ml susp azithromycin', 'cat-liquids', 'زجاجة', '17.00', '25.00', '25.00', '12.00', '3.00', '2027-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0084', 'co amoxiclav 125/31.25 mg susp', 'cat-liquids', 'زجاجة', '15.00', '13.00', '20.00', '30.00', '5.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0085', 'rivaclav 457mg susp', 'cat-liquids', 'زجاجة', '17.00', '15.00', '20.00', '117.00', '12.00', '2027-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0086', 'thera lo 160mg syr acamol', 'cat-liquids', 'زجاجة', '9.00', '8.00', '15.00', '17.00', '3.00', '2027-03-24', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0087', 'congestal syr', 'cat-liquids', 'زجاجة', '10.00', '9.00', '13.00', '112.00', '12.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0088', 'antitussin syr', 'cat-liquids', 'زجاجة', '10.00', '9.00', '15.00', '60.00', '8.00', '2027-05-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0089', 'tusskan syr', 'cat-liquids', 'زجاجة', '10.00', '9.00', '15.00', '47.00', '8.00', '2029-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0090', 'flavicef 100mg susp Cifexim', 'cat-liquids', 'زجاجة', '17.00', '15.00', '25.00', '40.00', '8.00', '2027-07-03', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0091', 'argiferol syr', 'cat-liquids', 'زجاجة', '20.00', '18.00', '25.00', '5.00', '2.00', '2027-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0092', 'rame zithro susp', 'cat-liquids', 'زجاجة', '14.00', '12.00', '20.00', '85.00', '12.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0093', 'duracef susp cifadroxil', 'cat-liquids', 'زجاجة', '14.00', '13.00', '20.00', '35.00', '5.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0094', 'histazine syr', 'cat-liquids', 'زجاجة', '12.00', '10.00', '15.00', '31.00', '5.00', '2027-07-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0095', 'megafen syr', 'cat-liquids', 'زجاجة', '8.00', '8.00', '10.00', '33.00', '5.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0096', 'pentamix syr', 'cat-liquids', 'زجاجة', '15.00', '14.00', '18.00', '5.00', '2.00', '2027-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0097', 'augmentin 457mg susp', 'cat-liquids', 'زجاجة', '17.00', '16.00', '20.00', '65.00', '8.00', '2027-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0098', 'xilone 5mg syr', 'cat-liquids', 'زجاجة', '10.00', '9.00', '15.00', '71.00', '8.00', '2029-01-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0099', 'dolo d plus syr', 'cat-liquids', 'زجاجة', '12.00', '11.00', '15.00', '248.00', '20.00', '2027-09-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0100', '123 syr', 'cat-liquids', 'زجاجة', '12.00', '12.00', '15.00', '174.00', '20.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0101', 'augmentin 312.5mg susp', 'cat-liquids', 'زجاجة', '17.00', '15.00', '20.00', '48.00', '8.00', '2027-01-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0102', 'Nystatin drop', 'cat-drops', 'عبوة', '8.00', '8.00', '10.00', '13.00', '3.00', '2028-08-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0103', 'zithrokan susp', 'cat-liquids', 'زجاجة', '12.00', '11.00', '17.00', '85.00', '12.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0104', 'flagellat forte 200mg syr', 'cat-liquids', 'زجاجة', '12.00', '10.00', '15.00', '5.00', '2.00', '2028-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0105', 'sprorofulvin 125mg syr', 'cat-liquids', 'زجاجة', '17.00', '14.00', '20.00', '65.00', '8.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0106', 'e moxclav 600mg susp', 'cat-liquids', 'زجاجة', '18.00', '16.00', '20.00', '72.00', '8.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0107', 'tussivan n syr', 'cat-liquids', 'زجاجة', '9.00', '9.00', '15.00', '162.00', '20.00', '2027-03-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0108', 'simethicone drop', 'cat-drops', 'عبوة', '10.00', '8.00', '15.00', '82.00', '12.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0109', 'cevandra plus syr', 'cat-liquids', 'زجاجة', '10.00', '9.00', '15.00', '21.00', '5.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0110', 'amoxicillin 125mg susp', 'cat-liquids', 'زجاجة', '13.00', '8.00', '17.00', '28.00', '5.00', '2026-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0111', 'miloxy 125mg susp amoxicillin', 'cat-liquids', 'زجاجة', '13.00', '8.00', '17.00', '400.00', '20.00', '2026-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0112', 'pentacold syr', 'cat-liquids', 'زجاجة', '10.00', '9.00', '15.00', '17.00', '3.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0113', 'bacticlor 250mg susp ceklar', 'cat-liquids', 'زجاجة', '20.00', '16.00', '25.00', '15.00', '3.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0114', 'urin bag كيس بول', 'cat-other', 'علبة', '3.00', '2.00', '4.00', '150.00', '20.00', '2027-01-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0115', 'stimulant syr', 'cat-liquids', 'زجاجة', '15.00', '13.00', '20.00', '15.00', '3.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0116', 'elbavit syr', 'cat-liquids', 'زجاجة', '17.00', '15.00', '20.00', '20.00', '5.00', '2027-10-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0117', 'hisatrup syr lorax', 'cat-liquids', 'زجاجة', '15.00', '13.00', '20.00', '16.00', '3.00', '2026-10-24', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0118', 'cefathird 125mg susp adcef', 'cat-liquids', 'زجاجة', '23.00', '20.00', '30.00', '16.00', '3.00', '2028-05-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0119', 'egy pedical plus syr', 'cat-liquids', 'زجاجة', '17.00', '15.00', '20.00', '12.00', '3.00', '2027-09-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0120', 'atomorelax syr', 'cat-liquids', 'زجاجة', '25.00', '20.00', '30.00', '14.00', '3.00', '2027-07-11', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0121', 'alzental syr', 'cat-liquids', 'زجاجة', '8.00', '6.00', '15.00', '56.00', '8.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0122', 'telfast syr', 'cat-liquids', 'زجاجة', '22.00', '20.00', '25.00', '30.00', '5.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0123', 'nurofen syr trufen', 'cat-liquids', 'زجاجة', '16.00', '15.00', '20.00', '32.00', '5.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0124', 'tiralepsy 100mg syr', 'cat-liquids', 'زجاجة', '35.00', '30.00', '40.00', '19.00', '3.00', '2028-01-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0125', 'amrizole syr flagyl', 'cat-liquids', 'زجاجة', '10.00', '9.00', '13.00', '79.00', '8.00', '2026-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0126', 'hadeel فوط اولويز كبير', 'cat-other', 'علبة', '8.50', '8.00', '8.00', '80.00', '12.00', '2027-01-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0127', 'hadeel فوط اولويز صغير', 'cat-other', 'علبة', '4.00', '3.00', '5.00', '160.00', '20.00', '2027-01-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0128', 'freshdays فوط يومية', 'cat-other', 'علبة', '12.00', '10.00', '15.00', '27.00', '5.00', '2027-01-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0129', 'fam فوط', 'cat-other', 'علبة', '3.00', '2.00', '5.00', '36.00', '5.00', '2027-01-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0130', 'كانيولا', 'cat-other', 'علبة', '2.00', '1.00', '3.00', '500.00', '20.00', '2028-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0131', 'calamyl lotion', 'cat-topical', 'أنبوب', '16.00', '14.00', '18.00', '16.00', '3.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0132', 'licid lotion', 'cat-topical', 'أنبوب', '17.00', '14.00', '20.00', '7.00', '2.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0133', 'silar cream الرشيد', 'cat-topical', 'أنبوب', '18.00', '18.00', '25.00', '22.00', '5.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0134', 'acyclovir 5% cream الرشيد', 'cat-topical', 'أنبوب', '16.00', '16.00', '20.00', '20.00', '5.00', '2027-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0135', 'carefyte granules Uraylt u', 'cat-other', 'علبة', '60.00', '55.00', '70.00', '7.00', '2.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0136', 'carefree فوط يومية', 'cat-other', 'علبة', '12.00', '10.00', '15.00', '31.00', '5.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0137', 'nu spasm 3amp scobutyl', 'cat-inject', 'علبة', '12.00', '11.00', '15.00', '20.00', '5.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0138', 'epizolone depot 40mg vial', 'cat-inject', 'علبة', '12.00', '10.00', '15.00', '10.00', '3.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0139', 'dclophen 75mg 3amp', 'cat-inject', 'علبة', '8.00', '7.00', '15.00', '114.00', '12.00', '2028-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0140', 'cidotestone 250mg 1amp', 'cat-inject', 'علبة', '16.00', '12.00', '20.00', '5.00', '2.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0141', 'mixtard 30 vial', 'cat-inject', 'علبة', '0.00', '0.00', '0.00', '3.00', '2.00', '2026-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0142', 'sunnypyramid 1amp pramin', 'cat-inject', 'علبة', '2.50', '1.50', '5.00', '213.00', '20.00', '2026-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0143', 'voltaren 75mg 3amp dclophen', 'cat-inject', 'علبة', '7.00', '6.00', '15.00', '7.00', '2.00', '2027-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0144', 'devarol s amp vit d 200000', 'cat-inject', 'علبة', '9.00', '8.00', '12.00', '29.00', '5.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0145', 'dispercam 6amp pirox', 'cat-inject', 'علبة', '18.00', '17.00', '30.00', '32.00', '5.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0146', 'adwiflam 75g 6amp', 'cat-inject', 'علبة', '15.00', '14.00', '30.00', '158.00', '20.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0147', 'Betafos 1amp', 'cat-inject', 'علبة', '11.00', '9.00', '15.00', '54.00', '8.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0148', 'mobitil 3amp', 'cat-inject', 'علبة', '9.00', '8.00', '15.00', '299.00', '20.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0149', 'garamycin 80mg 3amp', 'cat-inject', 'علبة', '9.00', '8.00', '15.00', '60.00', '8.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0150', 'dexamethasone 5amp', 'cat-inject', 'علبة', '12.50', '9.00', '25.00', '233.00', '20.00', '2028-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0151', 'cerebrolysin 5ml 5amp', 'cat-inject', 'علبة', '125.00', '120.00', '175.00', '4.00', '2.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0152', 'betolvex 2amp b12', 'cat-inject', 'علبة', '11.00', '10.00', '14.00', '16.00', '3.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0153', 'emerest 4mg 5amp', 'cat-inject', 'علبة', '18.00', '16.00', '25.00', '15.00', '3.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0154', 'sunnypyramid 5amp', 'cat-inject', 'علبة', '17.50', '12.00', '25.00', '19.00', '3.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0155', 'epirelefan 40mg vial kenacort', 'cat-inject', 'علبة', '12.00', '9.00', '15.00', '5.00', '2.00', '2028-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0156', 'diclac 75mg 5amp dclophen', 'cat-inject', 'علبة', '12.00', '10.00', '25.00', '35.00', '5.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0157', 'Epigonal 75 vial', 'cat-inject', 'علبة', '72.00', '68.00', '75.00', '3.00', '2.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0158', 'depovit b12 1000 5amp', 'cat-inject', 'علبة', '15.00', '13.00', '20.00', '9.00', '2.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0159', 'triacetecort 40mg 1vial kenacort', 'cat-inject', 'علبة', '12.00', '10.00', '15.00', '15.00', '3.00', '2027-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0160', 'davalindi 2amp vit d 200000', 'cat-inject', 'علبة', '15.00', '10.00', '20.00', '98.00', '12.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0161', 'Neurovit 6amp', 'cat-inject', 'علبة', '19.00', '17.00', '24.00', '502.00', '20.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0162', 'prontogest 400mg 30supp', 'cat-supp', 'علبة', '35.00', '32.00', '50.00', '5.00', '2.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0163', 'gynozol 200mg 6supp', 'cat-supp', 'علبة', '13.00', '10.00', '20.00', '61.00', '8.00', '2024-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0164', 'gynozol 400mg 3supp', 'cat-supp', 'علبة', '13.00', '11.00', '15.00', '30.00', '5.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0165', 'dolphin 25mg 10supp', 'cat-supp', 'علبة', '6.00', '5.50', '10.00', '142.00', '12.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0166', 'dolphin 12.5mg 10supp', 'cat-supp', 'علبة', '6.00', '5.50', '10.00', '132.00', '12.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0167', 'monicur 400mg 3supp', 'cat-supp', 'علبة', '10.00', '9.00', '15.00', '69.00', '8.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0168', 'decongestyl N 12supp', 'cat-supp', 'علبة', '15.00', '12.00', '20.00', '48.00', '8.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0169', 'indomethacin 10supp', 'cat-supp', 'علبة', '15.00', '12.00', '20.00', '104.00', '12.00', '2027-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0170', 'diclofen 12.5mg 10supp', 'cat-supp', 'علبة', '11.00', '10.00', '12.00', '25.00', '5.00', '2030-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0171', 'babyrelef 25mg 10supp diclofen', 'cat-supp', 'علبة', '9.00', '8.00', '10.00', '171.00', '20.00', '2028-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0172', 'babyrelef 12.5mg 10supp', 'cat-supp', 'علبة', '8.00', '7.00', '10.00', '131.00', '12.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0173', 'bivatracin spray', 'cat-topical', 'أنبوب', '23.00', '19.00', '20.00', '198.00', '20.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0174', 'symbicort 160 dose inhaler', 'cat-other', 'علبة', '65.00', '60.00', '70.00', '29.00', '5.00', '2027-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0175', 'gentamicin drop', 'cat-drops', 'عبوة', '9.00', '8.00', '10.00', '123.00', '12.00', '2026-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0176', 'lubrivisic drop', 'cat-drops', 'عبوة', '17.00', '15.00', '20.00', '4.00', '2.00', '2028-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0177', 'idelox drop', 'cat-drops', 'عبوة', '14.00', '13.00', '17.00', '4.00', '2.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0178', 'maxitrol drop مسروجي', 'cat-drops', 'عبوة', '22.00', '20.00', '25.00', '54.00', '8.00', '2027-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0179', 'maxitrol ointment مسروجي', 'cat-topical', 'أنبوب', '31.00', '29.00', '35.00', '0.00', '2.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0180', 'lacritears drop', 'cat-drops', 'عبوة', '9.00', '7.00', '15.00', '274.00', '20.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0181', 'solofresh drop', 'cat-drops', 'عبوة', '12.00', '11.00', '15.00', '46.00', '8.00', '2027-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0182', 'polyfresh drop', 'cat-drops', 'عبوة', '9.00', '7.00', '15.00', '419.00', '20.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0183', 'ramedazolamide drop', 'cat-drops', 'عبوة', '16.00', '15.00', '18.00', '38.00', '5.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0184', 'picolax drop', 'cat-drops', 'عبوة', '8.00', '7.00', '10.00', '97.00', '12.00', '2026-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0185', 'murnez nasal spray', 'cat-topical', 'أنبوب', '22.00', '20.00', '25.00', '70.00', '8.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0186', 'tobrex ointment مسروجي', 'cat-topical', 'أنبوب', '15.00', '13.00', '20.00', '96.00', '12.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0187', 'ojoblick eye oint', 'cat-topical', 'أنبوب', '13.00', '12.00', '20.00', '62.00', '8.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0188', 'ramedafenac drop', 'cat-drops', 'عبوة', '11.00', '10.00', '15.00', '18.00', '3.00', '2026-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0189', 'twinzol drop', 'cat-drops', 'عبوة', '20.00', '18.00', '25.00', '3.00', '2.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0190', 'plegica drop', 'cat-drops', 'عبوة', '15.00', '13.00', '20.00', '41.00', '8.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0191', 'otrivin child nasal drop', 'cat-drops', 'عبوة', '7.00', '6.00', '10.00', '24.00', '5.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0192', 'xolamol drop', 'cat-drops', 'عبوة', '16.00', '13.00', '20.00', '40.00', '8.00', '2027-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0193', 'orchapred drop', 'cat-drops', 'عبوة', '9.00', '8.00', '15.00', '52.00', '8.00', '2027-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0194', 'Optiflox drop', 'cat-drops', 'عبوة', '12.00', '12.00', '15.00', '64.00', '8.00', '2027-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0195', 'optidex T drop', 'cat-drops', 'عبوة', '12.00', '12.00', '15.00', '54.00', '8.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0196', 'tymer drop', 'cat-drops', 'عبوة', '22.00', '20.00', '25.00', '41.00', '8.00', '2026-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0197', 'dexaflox drop', 'cat-drops', 'عبوة', '12.00', '10.00', '15.00', '154.00', '20.00', '2027-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0198', 'co avazir drop', 'cat-drops', 'عبوة', '9.00', '8.00', '15.00', '7.00', '2.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0199', 'otal drop', 'cat-drops', 'عبوة', '9.00', '8.00', '12.00', '311.00', '20.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0200', 'trillerg drop', 'cat-drops', 'عبوة', '12.00', '10.00', '15.00', '71.00', '8.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0201', 'fluca drop', 'cat-drops', 'عبوة', '12.00', '10.00', '15.00', '210.00', '20.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0202', 'optipred drop', 'cat-drops', 'عبوة', '14.00', '12.00', '15.00', '165.00', '20.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0203', 'dexatobrin drop', 'cat-drops', 'عبوة', '10.00', '9.00', '15.00', '147.00', '12.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0204', 'dexatrol drop', 'cat-drops', 'عبوة', '10.00', '10.00', '15.00', '48.00', '8.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0205', 'uniflox drop oflox', 'cat-drops', 'عبوة', '17.00', '14.00', '20.00', '30.00', '5.00', '2026-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0206', 'benox drop', 'cat-drops', 'عبوة', '8.00', '7.00', '10.00', '362.00', '20.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0207', 'prisoline drop', 'cat-drops', 'عبوة', '7.00', '5.00', '10.00', '442.00', '20.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0208', 'tears guard drop', 'cat-drops', 'عبوة', '15.00', '14.00', '20.00', '171.00', '20.00', '2028-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0209', 'ofusidic drop', 'cat-drops', 'عبوة', '15.00', '12.00', '20.00', '156.00', '20.00', '2026-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0210', 'orchacin drop', 'cat-drops', 'عبوة', '9.00', '8.00', '15.00', '76.00', '8.00', '2027-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0211', 'tobrin drop', 'cat-drops', 'عبوة', '9.00', '8.00', '15.00', '10.00', '3.00', '2027-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0212', 'oftadilate 1% 20unit drop', 'cat-drops', 'عبوة', '20.00', '20.00', '30.00', '10.00', '3.00', '2027-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0213', 'otocort drop', 'cat-drops', 'عبوة', '9.00', '8.00', '15.00', '203.00', '20.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0214', 'لهاية غطاء بدون سلسلة فرخ 12قطعة', 'cat-other', 'علبة', '50.00', '40.00', '60.00', '96.00', '12.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0215', 'غيار رضاعة كيس 200 قطعة', 'cat-other', 'علبة', '170.00', '120.00', '400.00', '13.00', '3.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0216', 'شاش لفاف رول حجم / 5سم و 7سم', 'cat-other', 'علبة', '1.80', '1.50', '2.00', '899.00', '20.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0217', 'شاش لفاف رول حجم / 10سم', 'cat-other', 'علبة', '2.00', '1.80', '3.00', '800.00', '20.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0218', 'حليب فرانس ليت رقم 1', 'cat-other', 'علبة', '57.00', '57.00', '60.00', '48.00', '8.00', '2027-06-14', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0219', 'حليب فرانس ليت رقم 2', 'cat-other', 'علبة', '57.00', '57.00', '60.00', '36.00', '5.00', '2027-02-16', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0220', 'سيريلاك نانيلاك nanilac جميع الأطعمة', 'cat-other', 'علبة', '33.00', '33.00', '35.00', '120.00', '12.00', '2027-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0221', 'سيريلاك اختيار الام كرتونة', 'cat-other', 'علبة', '17.00', '15.00', '20.00', '19.00', '3.00', '2026-08-12', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0222', 'orovex mouth wash قرنفل', 'cat-topical', 'أنبوب', '20.00', '18.00', '25.00', '12.00', '3.00', '2028-10-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0223', 'orovex mouth wash تفاح', 'cat-topical', 'أنبوب', '20.00', '18.00', '25.00', '26.00', '5.00', '2028-09-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0224', 'orovex mouth wash نعنع', 'cat-topical', 'أنبوب', '20.00', '18.00', '25.00', '18.00', '3.00', '2028-10-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0225', 'قربة ماء اطفال', 'cat-other', 'علبة', '8.00', '7.00', '10.00', '119.00', '12.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0226', 'safa cream', 'cat-topical', 'أنبوب', '18.00', '15.00', '25.00', '331.00', '20.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0227', 'لهاية سلسلة وغطاء فرخ 12 قطعة', 'cat-other', 'علبة', '70.00', '60.00', '120.00', '11.00', '3.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0228', 'حلمة ثدي صناعية', 'cat-other', 'علبة', '11.00', '9.00', '15.00', '72.00', '8.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0229', 'حليب لاكتو رقم 1', 'cat-other', 'علبة', '23.00', '20.00', '30.00', '13.00', '3.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0230', 'لهاية سلسلة وغطاء قطعة mumlove', 'cat-other', 'عبوة', '8.50', '8.00', '10.00', '336.00', '20.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0231', 'حنة امير اسود 6 كيس', 'cat-other', 'علبة', '25.00', '15.00', '30.00', '12.00', '3.00', '2029-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0232', 'حنة امير بني 6 كيس', 'cat-other', 'علبة', '25.00', '15.00', '30.00', '135.00', '12.00', '2029-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0233', 'حنة امير خمري 6 كيس', 'cat-other', 'علبة', '25.00', '15.00', '30.00', '50.00', '8.00', '2029-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0234', 'adol 100mg/1ml drop paracetamol', 'cat-drops', 'عبوة', '4.00', '3.00', '5.00', '400.00', '20.00', '2026-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0235', 'رضاعة اختيار الام وسط 150مل', 'cat-other', 'علبة', '11.00', '8.50', '15.00', '283.00', '20.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0236', 'رضاعة اختيار الام كبير 240مل', 'cat-other', 'علبة', '11.00', '8.50', '15.00', '5.00', '2.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0237', 'رضاعة zhili سيريلاك', 'cat-other', 'علبة', '20.00', '14.00', '25.00', '51.00', '8.00', '2027-01-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0238', 'رضاعة وسط mumlove 150ml', 'cat-other', 'عبوة', '11.00', '8.50', '15.00', '207.00', '20.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0239', 'رضاعة كبير mumlove 240ml', 'cat-other', 'عبوة', '11.00', '8.50', '15.00', '133.00', '12.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0240', 'رضاعة اعشاب mumlove', 'cat-other', 'عبوة', '8.00', '7.00', '10.00', '77.00', '8.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0241', 'رضاعة fish غيار عريض', 'cat-other', 'علبة', '18.00', '15.00', '20.00', '63.00', '8.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0242', 'بسكويت اطفال 4 كيس', 'cat-other', 'علبة', '28.00', '20.00', '23.00', '4.00', '2.00', '2026-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0243', 'beclo asma inhaler', 'cat-other', 'علبة', '0.00', '0.00', '0.00', '333.00', '20.00', NULL, NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0244', 'IV set بربيش محلول', 'cat-inject', 'علبة', '2.00', '0.50', '3.00', '700.00', '20.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0245', 'كريم سحر الجمال', 'cat-other', 'علبة', '18.00', '17.00', '20.00', '36.00', '5.00', '2026-09-02', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0246', 'تيرموميتر الكتروني', 'cat-other', 'علبة', '12.00', '8.00', '15.00', '62.00', '8.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0247', 'zinc oxide 2.5 cm لزق لفاف', 'cat-other', 'علبة', '4.00', '2.50', '5.00', '228.00', '20.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0248', 'محلول ملحي 0.9', 'cat-other', 'علبة', '12.00', '8.00', '17.00', '7.00', '2.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0249', 'لزق تواليل 6 لزقة', 'cat-other', 'علبة', '8.00', '3.00', '10.00', '576.00', '20.00', '2025-11-12', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0250', 'paracetamol IV', 'cat-inject', 'علبة', '9.00', '8.00', '15.00', '13.00', '3.00', '2027-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0251', 'شاش رول لفاف 10 سم', 'cat-other', 'علبة', '2.00', '1.00', '3.00', '160.00', '20.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0252', 'xylene 2% gel lidocaine', 'cat-topical', 'أنبوب', '3.00', '3.00', '5.00', '50.00', '8.00', '2026-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0253', 'معجون اسنان مسواك مع فرشاة', 'cat-other', 'علبة', '6.00', '5.00', '8.00', '108.00', '12.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0254', 'معجون اسنان مسواك', 'cat-other', 'علبة', '6.00', '5.00', '7.00', '42.00', '8.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0255', 'nizapex shampoo', 'cat-topical', 'أنبوب', '13.00', '11.00', '18.00', '60.00', '8.00', '2028-07-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0256', 'hair shampoo 400ml', 'cat-topical', 'أنبوب', '13.00', '9.00', '15.00', '36.00', '5.00', '2027-09-09', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0257', 'حليب سيليا رقم 1', 'cat-other', 'علبة', '30.00', '25.00', '35.00', '60.00', '8.00', '2026-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0258', 'فوط صدر camara', 'cat-other', 'علبة', '12.00', '10.00', '15.00', '96.00', '12.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0259', 'sildava 8tab', 'cat-solid', 'علبة', '18.00', '15.00', '24.00', '56.00', '8.00', '2027-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0260', 'virecta 9tab', 'cat-solid', 'علبة', '8.00', '6.00', '15.00', '408.00', '20.00', '2024-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0261', 'erec 8tab', 'cat-solid', 'علبة', '12.00', '10.00', '16.00', '12.00', '3.00', '2028-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0262', 'Doumega 8tab', 'cat-solid', 'علبة', '20.00', '18.00', '32.00', '105.00', '12.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0263', 'vardenorect 8tab', 'cat-solid', 'علبة', '18.00', '16.00', '20.00', '89.00', '12.00', '2027-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0264', 'Delay كريم تأخير', 'cat-other', 'علبة', '4.00', '3.00', '5.00', '192.00', '20.00', '2026-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0265', 'powerecta 4tab', 'cat-solid', 'علبة', '8.00', '5.00', '10.00', '19.00', '3.00', '2024-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0266', 'joybox 6tab', 'cat-solid', 'علبة', '18.00', '17.00', '24.00', '116.00', '12.00', '2027-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0267', 'cerave itch relief moisturizing lotion 236ml', 'cat-topical', 'أنبوب', '70.00', '45.00', '90.00', '14.00', '3.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0268', 'cerave itch relief moisturizing lotion 237ml', 'cat-topical', 'أنبوب', '70.00', '45.00', '90.00', '20.00', '5.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0269', 'vichy spf50+ cr', 'cat-topical', 'أنبوب', '80.00', '45.00', '130.00', '90.00', '12.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0270', 'cerave SA lotion rough and bumpy skin', 'cat-topical', 'أنبوب', '70.00', '45.00', '90.00', '3.00', '2.00', '2029-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0271', 'cerave Psoriasis cleanser', 'cat-topical', 'أنبوب', '70.00', '45.00', '90.00', '24.00', '5.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0272', 'hepat panthenol plus carbamid cr', 'cat-topical', 'أنبوب', '20.00', '14.00', '25.00', '38.00', '5.00', '2028-08-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0273', 'hepta panthenol cr', 'cat-topical', 'أنبوب', '20.00', '14.00', '25.00', '84.00', '12.00', '2028-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0274', 'cerave moisturising cream', 'cat-topical', 'أنبوب', '70.00', '45.00', '90.00', '28.00', '5.00', '2029-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0275', 'cerave SA 10% urea cream', 'cat-topical', 'أنبوب', '85.00', '45.00', '100.00', '11.00', '3.00', '2026-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0276', 'cerave baby cream', 'cat-topical', 'أنبوب', '60.00', '35.00', '65.00', '15.00', '3.00', '2027-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0277', 'bioderma ABC cold cream', 'cat-topical', 'أنبوب', '80.00', '45.00', '90.00', '7.00', '2.00', '2027-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0278', 'melanofree cream', 'cat-topical', 'أنبوب', '15.00', '12.00', '20.00', '88.00', '12.00', '2028-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0279', 'melano whitening serum', 'cat-topical', 'أنبوب', '20.00', '10.00', '30.00', '9.00', '2.00', '2029-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0280', 'melano perfume pink petal lotion', 'cat-topical', 'أنبوب', '18.00', '13.00', '25.00', '10.00', '3.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0281', 'veet cream مزيل شعر', 'cat-topical', 'أنبوب', '22.00', '18.00', '30.00', '2.00', '2.00', '2027-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0282', 'hair plus 2% spray', 'cat-topical', 'أنبوب', '55.00', '50.00', '65.00', '2.00', '2.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0283', 'perfectodil 5% spray', 'cat-topical', 'أنبوب', '31.00', '28.00', '40.00', '20.00', '5.00', '2028-02-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0284', 'زيت ريكسي', 'cat-other', 'علبة', '7.00', '3.00', '10.00', '43.00', '8.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0285', 'sence face scrub', 'cat-other', 'علبة', '60.00', '50.00', '70.00', '3.00', '2.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0286', 'sence face wash', 'cat-topical', 'أنبوب', '65.00', '50.00', '75.00', '21.00', '5.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0287', 'vichy 3in1 cleanser toner and eye make up remover', 'cat-topical', 'أنبوب', '90.00', '45.00', '100.00', '11.00', '3.00', NULL, NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0288', 'vichy capiyal soleil soothing milk face and body', 'cat-other', 'علبة', '80.00', '45.00', '90.00', '6.00', '2.00', NULL, NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0289', 'laroche posay ultra serum', 'cat-topical', 'أنبوب', '70.00', '45.00', '80.00', '12.00', '3.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0290', 'laroche posay AB+ serum', 'cat-topical', 'أنبوب', '60.00', '45.00', '70.00', '9.00', '2.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0291', 'cerave diabetics dry skin relief cream uria', 'cat-topical', 'أنبوب', '60.00', '45.00', '70.00', '13.00', '3.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0292', 'starville acne prone skin cream', 'cat-topical', 'أنبوب', '20.00', '18.00', '30.00', '75.00', '8.00', '2027-12-24', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0293', 'vichy normaderm cream', 'cat-topical', 'أنبوب', '70.00', '45.00', '80.00', '39.00', '5.00', '2027-01-14', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0294', 'vichy neovadiol px serum', 'cat-topical', 'أنبوب', '65.00', '45.00', '70.00', '28.00', '5.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0295', 'vichy normaderm acne prone skin BHA serum', 'cat-topical', 'أنبوب', '65.00', '45.00', '70.00', '11.00', '3.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0296', 'vichy liftactiv serum', 'cat-topical', 'أنبوب', '65.00', '45.00', '70.00', '12.00', '3.00', '2020-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0297', 'كريم فاتيكا', 'cat-other', 'علبة', '13.00', '11.00', '15.00', '42.00', '8.00', '2027-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0298', 'avene spf50+ cream', 'cat-topical', 'أنبوب', '90.00', '35.00', '110.00', '81.00', '12.00', '2026-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0299', 'لزقة ظهر جونسون', 'cat-other', 'علبة', '4.00', '3.00', '5.00', '20.00', '5.00', '2028-09-10', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0300', 'pregnancy test فحص حمل', 'cat-other', 'علبة', '3.50', '2.50', '5.00', '1560.00', '20.00', '2027-06-22', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0301', 'مخمرية مسك الطهارة رول', 'cat-other', 'علبة', '25.00', '21.00', '28.00', '38.00', '5.00', '2030-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0302', 'شفرة جهاز يدوية كرتونة', 'cat-other', 'علبة', '50.00', '45.00', '60.00', '4.00', '2.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0303', 'فازلين كريم', 'cat-other', 'علبة', '18.00', '16.00', '20.00', '4.00', '2.00', '2027-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0304', 'فيبكس كريم مزيل عرق', 'cat-other', 'علبة', '9.00', '8.00', '10.00', '24.00', '5.00', '2027-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0305', 'مزيل عرق ريكسونا رول', 'cat-other', 'علبة', '12.00', '10.00', '15.00', '138.00', '12.00', '2027-05-02', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0306', 'مزيل عرق نيفيا رجالي رول', 'cat-other', 'علبة', '12.00', '9.00', '15.00', '42.00', '8.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0307', 'مزيل عرق نيفيا حريمي رول', 'cat-other', 'علبة', '12.00', '9.00', '15.00', '24.00', '5.00', '2027-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0308', 'شفرة جيليت رخيصة 5قطع', 'cat-other', 'علبة', '12.00', '9.00', '15.00', '4.00', '2.00', '2026-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0309', 'مزيل عرق دوف رول', 'cat-other', 'علبة', '12.00', '8.50', '15.00', '18.00', '3.00', '2027-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0310', 'زيت شعر دابر املا', 'cat-other', 'علبة', '18.00', '16.00', '20.00', '6.00', '2.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0311', 'كريم candy للشعر النيقرو', 'cat-other', 'علبة', '16.00', '13.00', '25.00', '1.00', '2.00', '2028-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0312', 'wax black واكس اسود', 'cat-other', 'علبة', '38.00', '35.00', '40.00', '7.00', '2.00', '2026-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0313', 'كريم شعر بالمرز', 'cat-other', 'علبة', '22.00', '16.00', '25.00', '3.00', '2.00', '2026-08-24', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0314', 'كريم شعر فيانسه', 'cat-other', 'علبة', '18.00', '15.00', '25.00', '5.00', '2.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0315', 'حمام زيت شعر ميلانو', 'cat-other', 'علبة', '28.00', '22.00', '30.00', '6.00', '2.00', '2030-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0316', 'شامبو sunsilk', 'cat-other', 'علبة', '14.00', '13.00', '16.00', '8.00', '2.00', '2027-01-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0317', 'شامبو dandy اطفال', 'cat-other', 'علبة', '16.00', '20.00', '20.00', '10.00', '3.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0318', 'cerave itch relief moisturizing cr مدور', 'cat-topical', 'أنبوب', '55.00', '45.00', '60.00', '7.00', '2.00', '2026-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0319', 'eucerin cream مدور', 'cat-topical', 'أنبوب', '70.00', '45.00', '80.00', '5.00', '2.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0320', 'كريم جونسون الأزرق', 'cat-other', 'علبة', '18.00', '16.00', '20.00', '35.00', '5.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0321', 'كريم جونسون ابيض', 'cat-other', 'علبة', '18.00', '16.00', '20.00', '10.00', '3.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0322', 'نيفيا سوفت كريم وسط', 'cat-other', 'علبة', '16.00', '15.00', '18.00', '42.00', '8.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0323', 'كريم ايفا', 'cat-other', 'علبة', '13.00', '11.00', '15.00', '1.00', '2.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0324', 'نيفيا حديد الازرق حجم كبير 300ml', 'cat-other', 'عبوة', '22.00', '19.00', '25.00', '9.00', '2.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0325', 'محلول عدسات perfectlook 2قطعة', 'cat-other', 'علبة', '55.00', '50.00', '70.00', '2.00', '2.00', '2028-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0326', 'دهان الحنظل', 'cat-other', 'علبة', '9.00', '8.00', '15.00', '19.00', '3.00', '2028-11-01', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0327', 'فازلين صغير', 'cat-other', 'علبة', '12.00', '11.00', '15.00', '12.00', '3.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0328', 'فازلين كبير', 'cat-other', 'علبة', '16.00', '15.00', '18.00', '5.00', '2.00', '2027-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0329', 'alzental 200mg 2tab albendazol', 'cat-solid', 'علبة', '4.00', '2.00', '7.00', '320.00', '20.00', '2027-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0330', 'risek 20mg 14cap omeprazol', 'cat-solid', 'علبة', '9.00', '7.00', '10.00', '276.00', '20.00', '2026-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0331', 'corotrope 20mg 100tab prednisolone', 'cat-solid', 'علبة', '85.00', '70.00', '100.00', '55.00', '8.00', '2028-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0332', 'co vasotec 80/12.5mg 14tab', 'cat-solid', 'علبة', '17.00', '14.00', '20.00', '196.00', '20.00', '2028-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0333', 'co vasotec 160/12.5mg 14tab', 'cat-solid', 'علبة', '17.00', '14.00', '20.00', '750.00', '20.00', NULL, NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0334', 'celeborg 200mg 20cap', 'cat-solid', 'علبة', '16.00', '14.00', '20.00', '220.00', '20.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0335', 'spasmodigestin 30tab', 'cat-solid', 'علبة', '18.00', '14.00', '24.00', '4.00', '2.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0336', 'jeparilon 10tab', 'cat-solid', 'علبة', '13.00', '9.00', '15.00', '66.00', '8.00', NULL, NULL, 'المخزن الرئيسي', NULL);
INSERT INTO `products` (`id`, `name`, `category_id`, `base_unit`, `purchase_price`, `wholesale_price`, `sale_price`, `stock_qty`, `low_stock_threshold`, `expiry_date`, `branch_id`, `supplier_name`, `notes`) VALUES
('prd-wh-0337', 'streptoquin 20tab', 'cat-solid', 'علبة', '8.50', '7.50', '20.00', '408.00', '20.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0338', 'minalax 10tab', 'cat-solid', 'علبة', '9.00', '7.00', '15.00', '114.00', '12.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0339', 'librax 30tab', 'cat-solid', 'علبة', '14.00', '12.00', '21.00', '184.00', '20.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0340', 'laxeol pi 20tab', 'cat-solid', 'علبة', '17.00', '14.00', '30.00', '98.00', '12.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0341', 'nostifix 2tab Golin', 'cat-solid', 'علبة', '22.00', '17.00', '25.00', '70.00', '8.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0342', 'avara 20mg 30tab', 'cat-solid', 'علبة', '82.00', '70.00', '90.00', '12.00', '3.00', '2028-08-20', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0343', 'arthfree 20mg 20tab', 'cat-solid', 'علبة', '27.00', '25.00', '30.00', '146.00', '12.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0344', 'epicopred 20mg 20tab', 'cat-solid', 'علبة', '22.00', '18.00', '26.00', '40.00', '8.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0345', 'disprelone d 20mg 20tab', 'cat-solid', 'علبة', '22.00', '18.00', '26.00', '64.00', '8.00', '2028-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0346', 'solupred 20mg 20tab', 'cat-solid', 'علبة', '22.00', '18.00', '26.00', '49.00', '8.00', '2026-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0347', 'Zinnia p 21tab×3strip', 'cat-solid', 'علبة', '22.00', '16.00', '45.00', '86.00', '12.00', '2026-08-03', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0348', 'triocept 21tab×6strip', 'cat-solid', 'علبة', '38.00', '28.00', '60.00', '31.00', '5.00', '2028-05-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0349', 'steronate 5mg 20tab', 'cat-solid', 'علبة', '9.00', '8.00', '14.00', '100.00', '12.00', '2028-06-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0350', 'dophaston 60tab', 'cat-solid', 'علبة', '35.00', '31.00', '45.00', '255.00', '20.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0351', 'hystrogest 200mg 30tab', 'cat-solid', 'علبة', '40.00', '35.00', '75.00', '18.00', '3.00', '2028-10-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0352', 'elonda 2tab golin', 'cat-solid', 'علبة', '22.00', '18.00', '25.00', '43.00', '8.00', '2027-02-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0353', 'mucobrave 10sachat acytaylcistain', 'cat-other', 'علبة', '20.00', '17.00', '25.00', '13.00', '3.00', '2027-05-20', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0354', 'kellagon 20cap', 'cat-solid', 'علبة', '12.00', '10.00', '20.00', '20.00', '5.00', '2028-12-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0355', 'fawar fruit 6 sachets', 'cat-other', 'علبة', '8.00', '7.00', '9.00', '11.00', '3.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0356', 'predilone 5mg 10tab×25strip', 'cat-solid', 'علبة', '112.50', '90.00', '175.00', '93.00', '12.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0357', 'microlut 28tab×3strip', 'cat-solid', 'علبة', '28.00', '25.00', '39.00', '358.00', '20.00', '2028-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0358', 'microgynon ED 35tab×3strip', 'cat-solid', 'علبة', '40.00', '35.00', '45.00', '113.00', '12.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0359', 'pantomedra 40mg 28tab', 'cat-solid', 'علبة', '26.00', '23.00', '30.00', '10.00', '3.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0360', 'buscopan 20tab', 'cat-solid', 'علبة', '18.00', '16.00', '20.00', '22.00', '5.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0361', 'flucoral 150mg 2cap', 'cat-solid', 'علبة', '12.00', '9.00', '16.00', '55.00', '8.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0362', 'esomeprazol 20mg 10cap', 'cat-solid', 'علبة', '12.00', '9.00', '15.00', '62.00', '8.00', '2027-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0363', 'epimag 5mg 12 sachets', 'cat-other', 'علبة', '11.00', '9.00', '15.00', '23.00', '5.00', '2028-03-10', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0364', 'urosolvine 12 sachets', 'cat-other', 'علبة', '9.00', '9.00', '15.00', '14.00', '3.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0365', 'colona 30tab', 'cat-solid', 'علبة', '14.00', '12.00', '18.00', '330.00', '20.00', '2028-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0366', 'metrogypton 500mg 20tab flagyl', 'cat-solid', 'علبة', '8.00', '7.00', '10.00', '50.00', '8.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0367', 'flagyl 250mg 20tab', 'cat-solid', 'علبة', '8.00', '6.00', '10.00', '105.00', '12.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0368', 'flagyl 500mg 20tab', 'cat-solid', 'علبة', '9.00', '6.00', '7.00', '475.00', '20.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0369', 'controloc 40mg 14tab', 'cat-solid', 'علبة', '19.00', '17.00', '22.00', '40.00', '8.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0370', 'antopral 40mg 14tab', 'cat-solid', 'علبة', '18.00', '16.00', '20.00', '66.00', '8.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0371', 'carbamazepine 200mg 10tab', 'cat-solid', 'علبة', '6.00', '5.00', '8.00', '1300.00', '20.00', '2025-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0372', 'heli cure tab', 'cat-solid', 'علبة', '35.00', '30.00', '40.00', '111.00', '12.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0373', 'furazol 20tab', 'cat-solid', 'علبة', '15.00', '12.00', '20.00', '550.00', '20.00', '2029-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0374', 'eucarbon 20tab', 'cat-solid', 'علبة', '15.00', '12.00', '21.00', '566.00', '20.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0375', 'opranate 20mg 10tab', 'cat-solid', 'علبة', '8.00', '7.00', '15.00', '30.00', '5.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0376', 'rawatinex 45cap', 'cat-solid', 'علبة', '17.00', '12.00', '30.00', '43.00', '8.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0377', 'paracetamol 500mg 10tab', 'cat-solid', 'علبة', '3.50', '2.50', '4.00', '500.00', '20.00', '2026-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0378', 'dalacin c 300mg 16cap', 'cat-solid', 'علبة', '17.00', '15.00', '20.00', '43.00', '8.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0379', 'clindam 300mg 16cap', 'cat-solid', 'علبة', '16.00', '13.00', '20.00', '42.00', '8.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0380', 'trufen 600mg 5tab', 'cat-solid', 'علبة', '4.50', '4.00', '5.00', '600.00', '20.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0381', 'relax 30cap', 'cat-solid', 'علبة', '11.00', '9.00', '21.00', '100.00', '12.00', '2029-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0382', 'antinal 24cap', 'cat-solid', 'علبة', '10.00', '9.00', '20.00', '550.00', '20.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0383', 'azithromycin 250mg 6cap', 'cat-solid', 'علبة', '9.00', '6.00', '10.00', '3.00', '2.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0384', 'Klacid 500mg 14tab', 'cat-solid', 'علبة', '38.00', '34.00', '40.00', '8.00', '2.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0385', 'ciprofloxacin 500mg 10tab', 'cat-solid', 'علبة', '8.00', '7.00', '15.00', '20.00', '5.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0386', 'moxypen 500mg 20cap', 'cat-solid', 'علبة', '18.00', '16.00', '20.00', '20.00', '5.00', '2026-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0387', 'macrofuran 50mg 30cap', 'cat-solid', 'علبة', '15.00', '12.00', '30.00', '35.00', '5.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0388', 'mepafuran 100mg 20cap', 'cat-solid', 'علبة', '19.00', '15.00', '30.00', '75.00', '8.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0389', 'gastropan 40mg 30tab', 'cat-solid', 'علبة', '21.00', '17.00', '27.00', '40.00', '8.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0390', 'rame zithro 500mg 6cap', 'cat-solid', 'علبة', '15.00', '13.00', '20.00', '10.00', '3.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0391', 'azathioprine 50mg 30tab', 'cat-solid', 'علبة', '20.00', '15.00', '30.00', '10.00', '3.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0392', 'zinnat 500mg 10tab', 'cat-solid', 'علبة', '50.00', '43.00', '55.00', '14.00', '3.00', '2028-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0393', 'ciprodiazole 20tab', 'cat-solid', 'علبة', '25.00', '23.00', '30.00', '23.00', '5.00', '2027-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0394', 'zithrotel 250mg 6cap', 'cat-solid', 'علبة', '9.00', '6.00', '10.00', '15.00', '3.00', '2026-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0395', 'septazole 10tab', 'cat-solid', 'علبة', '4.00', '3.50', '10.00', '560.00', '20.00', '2029-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0396', 'cefathird 300mg 10tab', 'cat-solid', 'علبة', '23.00', '20.00', '30.00', '5.00', '2.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0397', 'dorofen 30cap', 'cat-solid', 'علبة', '32.00', '26.00', '39.00', '30.00', '5.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0398', 'plaquenil 200mg 60tab', 'cat-solid', 'علبة', '45.00', '35.00', '60.00', '36.00', '5.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0399', 'treflucan 150mg 2cap', 'cat-solid', 'علبة', '12.00', '6.00', '16.00', '100.00', '12.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0400', 'zomax 250mg 6cap azithromycin', 'cat-solid', 'علبة', '9.00', '6.00', '10.00', '35.00', '5.00', '2026-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0401', 'bigsens 850mg 10tab Metformin', 'cat-solid', 'علبة', '2.50', '1.50', '4.00', '1220.00', '20.00', '2026-12-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0402', 'ibuprofen 400mg 10tab', 'cat-solid', 'علبة', '4.50', '4.00', '5.00', '1400.00', '20.00', '2028-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0403', 'remevia 50mg 28tab sitagliptin', 'cat-solid', 'علبة', '30.00', '20.00', '50.00', '55.00', '8.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0404', 'uripan 30tab', 'cat-solid', 'علبة', '10.00', '9.00', '15.00', '250.00', '20.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0405', 'medochemie 500mg 10tab ciprofloxacin', 'cat-solid', 'علبة', '13.00', '13.00', '15.00', '200.00', '20.00', '2027-02-20', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0406', 'moxiflox 400mg 10tab', 'cat-solid', 'علبة', '30.00', '26.00', '40.00', '31.00', '5.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0407', 'tavanic 500mg 5tab', 'cat-solid', 'علبة', '20.00', '20.00', '25.00', '94.00', '12.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0408', 'tavacin 750mg 5tab', 'cat-solid', 'علبة', '22.00', '20.00', '25.00', '25.00', '5.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0409', 'cindamycin ABR 16cap', 'cat-solid', 'علبة', '10.00', '10.00', '20.00', '57.00', '8.00', '2026-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0410', 'Osteocare 30tab', 'cat-solid', 'علبة', '28.00', '22.00', '30.00', '94.00', '12.00', '2028-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0411', 'nanazoxid 18cap', 'cat-solid', 'علبة', '15.00', '13.00', '20.00', '180.00', '20.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0412', 'lee flox 500mg 5tab', 'cat-solid', 'علبة', '12.00', '10.00', '20.00', '685.00', '20.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0413', 'fondaclav 1g 12tab', 'cat-solid', 'علبة', '20.00', '18.00', '30.00', '205.00', '20.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0414', 'tavoniflox 500mg 7tab', 'cat-solid', 'علبة', '18.00', '16.00', '15.00', '114.00', '12.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0415', 'tavoniflox 750mg 7tab', 'cat-solid', 'علبة', '21.00', '17.00', '30.00', '109.00', '12.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0416', 'levanic 500mg 7tab', 'cat-solid', 'علبة', '19.00', '15.00', '25.00', '18.00', '3.00', '2028-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0417', 'levanic 750mg 7tab', 'cat-solid', 'علبة', '20.00', '17.00', '30.00', '20.00', '5.00', '2028-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0418', 'tranex 500mg 20tab', 'cat-solid', 'علبة', '25.00', '22.00', '30.00', '15.00', '3.00', '2028-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0419', 'augmentin 1g 14tab', 'cat-solid', 'علبة', '24.00', '18.00', '30.00', '184.00', '20.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0420', 'augram 500mg 14tab', 'cat-solid', 'علبة', '20.00', '18.00', '26.00', '15.00', '3.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0421', 'augmentin 625mg 10tab', 'cat-solid', 'علبة', '14.00', '12.00', '20.00', '565.00', '20.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0422', 'bi alcofan 150mg 30tab', 'cat-solid', 'علبة', '12.00', '9.00', '21.00', '315.00', '20.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0423', 'lee flox 750mg 7tab', 'cat-solid', 'علبة', '16.00', '14.00', '25.00', '405.00', '20.00', '2027-10-20', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0424', 'amaryl 2mg 30tab', 'cat-solid', 'علبة', '15.00', '7.00', '21.00', '28.00', '5.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0425', 'forxiga 10mg 28tab', 'cat-solid', 'علبة', '78.00', '70.00', '85.00', '7.00', '2.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0426', 'tritace comp 5mg/25mg 28tab', 'cat-solid', 'علبة', '20.00', '15.00', '30.00', '24.00', '5.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0427', 'tritace 5mg 28tab', 'cat-solid', 'علبة', '18.00', '15.00', '24.00', '28.00', '5.00', '2027-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0428', 'urivin n 10 sachets', 'cat-other', 'علبة', '8.00', '7.00', '10.00', '124.00', '12.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0429', 'tamsulin 0.4mg 28cap', 'cat-solid', 'علبة', '20.00', '18.00', '26.00', '85.00', '12.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0430', 'sirdalud 2mg 20tab', 'cat-solid', 'علبة', '22.00', '18.00', '30.00', '66.00', '8.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0431', 'Iksaront 2.5mg 30tab artixiban', 'cat-solid', 'علبة', '35.00', '25.00', '45.00', '10.00', '3.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0432', 'Tinogyn 500mg 4tab', 'cat-solid', 'علبة', '22.00', '20.00', '25.00', '29.00', '5.00', '2030-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0433', 'valsatens plus 160/25mg 30tab', 'cat-solid', 'علبة', '35.00', '27.00', '39.00', '30.00', '5.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0434', 'co vasotec 160/25mg 14tab', 'cat-solid', 'علبة', '25.00', '23.00', '30.00', '265.00', '20.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0435', 'colchicine 0.5mg 30tab متطورة', 'cat-solid', 'علبة', '24.00', '15.00', '30.00', '27.00', '5.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0436', 'colchicine 0.5mg 100tab مصري', 'cat-solid', 'علبة', '35.00', '35.00', '50.00', '125.00', '12.00', '2025-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0437', 'febucan 80mg 30tab', 'cat-solid', 'علبة', '16.00', '12.00', '21.00', '8.00', '2.00', '2026-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0438', 'creatocan 20mg 30tab', 'cat-solid', 'علبة', '15.00', '7.00', '21.00', '115.00', '12.00', '2025-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0439', 'anafranil SR 75mg 20tab', 'cat-solid', 'علبة', '16.00', '14.00', '20.00', '147.00', '12.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0440', 'anafranil 25mg 30tab', 'cat-solid', 'علبة', '12.00', '10.00', '21.00', '135.00', '12.00', '2027-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0441', 'tiralepsy 500mg 30tab', 'cat-solid', 'علبة', '35.00', '30.00', '45.00', '22.00', '5.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0442', 'tiratam 500mg 30tab', 'cat-solid', 'علبة', '35.00', '30.00', '45.00', '18.00', '3.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0443', 'triactin 4mg 20tab', 'cat-solid', 'علبة', '12.00', '9.00', '16.00', '667.00', '20.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0444', 'tryptizol 25mg 30tab', 'cat-solid', 'علبة', '12.00', '10.00', '18.00', '100.00', '12.00', '2029-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0445', 'tegretol 200mg 50tab مسروجي', 'cat-solid', 'علبة', '27.00', '21.00', '40.00', '5.00', '2.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0446', 'allerban SR 20tab', 'cat-solid', 'علبة', '12.00', '9.00', '20.00', '29.00', '5.00', '2028-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0447', 'vaxato 10mg 10tab', 'cat-solid', 'علبة', '22.00', '18.00', '25.00', '75.00', '8.00', '2028-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0448', 'candesartan 8mg 28tab', 'cat-solid', 'علبة', '22.00', '18.00', '30.00', '123.00', '12.00', '2028-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0449', 'pletaal 100mg 20tab', 'cat-solid', 'علبة', '20.00', '18.00', '30.00', '5.00', '2.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0450', 'nitromak retard 2.5 mg 60cap', 'cat-solid', 'علبة', '40.00', '30.00', '60.00', '9.00', '2.00', '2029-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0451', 'inderal 40mg 60tab prolol', 'cat-solid', 'علبة', '40.00', '30.00', '48.00', '6.00', '2.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0452', 'lovir 800mg 35tab', 'cat-solid', 'علبة', '45.00', '33.00', '70.00', '60.00', '8.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0453', 'ketofan 50mg 30cap', 'cat-solid', 'علبة', '12.00', '8.00', '21.00', '290.00', '20.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0454', 'artixiban 2.5mg 30tab', 'cat-solid', 'علبة', '55.00', '45.00', '60.00', '43.00', '8.00', '2027-05-25', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0455', 'artixiban 5mg 30tab', 'cat-solid', 'علبة', '55.00', '45.00', '60.00', '59.00', '8.00', '2028-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0456', 'vaxato 15mg 30tab', 'cat-solid', 'علبة', '75.00', '65.00', '79.00', '70.00', '8.00', '2027-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0457', 'vaxato 2.5mg 30tab', 'cat-solid', 'علبة', '60.00', '45.00', '75.00', '9.00', '2.00', '2027-10-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0458', 'vaxato 20mg 20tab', 'cat-solid', 'علبة', '90.00', '80.00', '105.00', '24.00', '5.00', '2028-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0459', 'deltavit b12 30tab', 'cat-solid', 'علبة', '22.00', '18.00', '25.00', '66.00', '8.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0460', 'Vitastress 20tab multivitamin', 'cat-solid', 'علبة', '15.00', '11.00', '10.00', '152.00', '20.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0461', 'doxycost 10tab', 'cat-solid', 'علبة', '13.00', '11.00', '15.00', '20.00', '5.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0462', 'aerius 30tab lorias', 'cat-solid', 'علبة', '21.00', '18.00', '25.00', '24.00', '5.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0463', 'galvus 50mg 28tab', 'cat-solid', 'علبة', '35.00', '30.00', '50.00', '15.00', '3.00', '2027-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0464', 'pepon plus 20cap', 'cat-solid', 'علبة', '25.00', '20.00', '30.00', '11.00', '3.00', '2025-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0465', 'selenium ACE 20tab', 'cat-solid', 'علبة', '18.00', '18.00', '39.00', '5.00', '2.00', '2027-01-20', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0466', 'stimulant 400mg 20cap', 'cat-solid', 'علبة', '15.00', '15.00', '20.00', '15.00', '3.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0467', 'wellwoman 30tab', 'cat-solid', 'علبة', '36.00', '32.00', '45.00', '10.00', '3.00', '2028-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0468', 'foltamethyl 30tab', 'cat-solid', 'علبة', '24.00', '20.00', '30.00', '9.00', '2.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0469', 'seizurles 500mg 30tab', 'cat-solid', 'علبة', '30.00', '25.00', '45.00', '46.00', '8.00', '2028-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0470', 'royal zad 12cap', 'cat-solid', 'علبة', '24.00', '20.00', '30.00', '4.00', '2.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0471', 'norkiaol 3D drop', 'cat-drops', 'عبوة', '10.00', '8.00', '15.00', '273.00', '20.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0472', 'safetrium 30tab', 'cat-solid', 'علبة', '25.00', '20.00', '30.00', '148.00', '12.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0473', 'l carnitine plus 20tab', 'cat-solid', 'علبة', '22.00', '19.00', '30.00', '20.00', '5.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0474', 'l carnitine 20tab', 'cat-solid', 'علبة', '18.00', '18.00', '26.00', '20.00', '5.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0475', 'carnivita forte 30tab', 'cat-solid', 'علبة', '30.00', '27.00', '45.00', '17.00', '3.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0476', 'calcium d3 30tab', 'cat-solid', 'علبة', '15.00', '11.00', '30.00', '55.00', '8.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0477', 'c retard zinc 20tab', 'cat-solid', 'علبة', '12.00', '9.00', '21.00', '20.00', '5.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0478', 'nutri mero 20tab', 'cat-solid', 'علبة', '38.00', '33.00', '45.00', '12.00', '3.00', '2026-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0479', 'olfen 100mg SR 10cap', 'cat-solid', 'علبة', '13.00', '10.00', '15.00', '280.00', '20.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0480', 'vitayami 30tab', 'cat-solid', 'علبة', '19.00', '15.00', '30.00', '465.00', '20.00', '2027-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0481', 'e mox 500mg 16cap', 'cat-solid', 'علبة', '7.00', '6.00', '12.00', '27.00', '5.00', '2029-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0482', 'pantogar 60cap', 'cat-solid', 'علبة', '40.00', '33.00', '60.00', '15.00', '3.00', '2028-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0483', 'flumox 1000mg 15tab', 'cat-solid', 'علبة', '16.00', '14.00', '30.00', '20.00', '5.00', '2028-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0484', 'sanso magnesium 250mg 30cap', 'cat-solid', 'علبة', '30.00', '22.00', '40.00', '20.00', '5.00', '2027-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0485', 'one and half 30tab multivitamin', 'cat-solid', 'علبة', '20.00', '17.00', '30.00', '112.00', '12.00', '2026-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0486', 'dolphin k 50mg 20tab', 'cat-solid', 'علبة', '11.00', '9.00', '20.00', '107.00', '12.00', '2027-12-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0487', 'azitheomash 500mg 3cap', 'cat-solid', 'علبة', '10.00', '8.00', '15.00', '75.00', '8.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0488', 'recoxibright 90mg 30tab', 'cat-solid', 'علبة', '28.00', '23.00', '45.00', '31.00', '5.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0489', 'adwiflam 50mg 20cap', 'cat-solid', 'علبة', '11.00', '8.00', '20.00', '31.00', '5.00', '2028-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0490', 'betaren 100mg SR 20tab', 'cat-solid', 'علبة', '22.00', '20.00', '20.00', '219.00', '20.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0491', 'mobitil 15mg 10tab', 'cat-solid', 'علبة', '9.00', '8.00', '10.00', '10.00', '3.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0492', 'limitless man 30tab', 'cat-solid', 'علبة', '25.00', '22.00', '30.00', '20.00', '5.00', '2026-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0493', 'dispercam 10tab', 'cat-solid', 'علبة', '12.00', '10.00', '15.00', '52.00', '8.00', '2028-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0494', 'xithrone 500mg 5cap azithromycin', 'cat-solid', 'علبة', '16.00', '12.00', '20.00', '58.00', '8.00', '2027-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0495', 'lornox 8mg 30tab', 'cat-solid', 'علبة', '26.00', '23.00', '30.00', '11.00', '3.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0496', 'celebrex 200mg 15cap', 'cat-solid', 'علبة', '17.00', '13.00', '20.00', '26.00', '5.00', '2026-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0497', 'megafen 30tab', 'cat-solid', 'علبة', '12.00', '8.00', '21.00', '10.00', '3.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0498', 'anselacox 90mg 30tab', 'cat-solid', 'علبة', '27.00', '24.00', '45.00', '40.00', '8.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0499', 'sapofen 400mg 20tab trufen', 'cat-solid', 'علبة', '8.00', '6.00', '10.00', '40.00', '8.00', '2026-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0500', 'anticox 15mg 30tab', 'cat-solid', 'علبة', '13.00', '11.00', '18.00', '310.00', '20.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0501', 'moxen 15mg 20tab', 'cat-solid', 'علبة', '13.00', '10.00', '16.00', '195.00', '20.00', '2028-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0502', 'vitacid c 12 eff', 'cat-other', 'علبة', '12.00', '10.00', '15.00', '29.00', '5.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0503', 'isotretinoin 20mg 30tab', 'cat-solid', 'علبة', '45.00', '39.00', '54.00', '87.00', '12.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0504', 'omega A.I.T 30cap', 'cat-solid', 'علبة', '33.00', '28.00', '13.00', '24.00', '5.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0505', 'catafast 50mg 9 sachets', 'cat-other', 'علبة', '18.00', '16.00', '21.00', '77.00', '8.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0506', 'ketolac 20tab', 'cat-solid', 'علبة', '13.00', '9.00', '20.00', '83.00', '12.00', '2027-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0507', 'ginco plus 20cap', 'cat-solid', 'علبة', '24.00', '20.00', '28.00', '14.00', '3.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0508', 'muscadol 20tab', 'cat-solid', 'علبة', '11.00', '9.00', '16.00', '66.00', '8.00', '2027-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0509', 'nervixal 30tab', 'cat-solid', 'علبة', '16.00', '11.00', '21.00', '139.00', '12.00', '2027-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0510', 'milga 40tab', 'cat-solid', 'علبة', '23.00', '20.00', '28.00', '91.00', '12.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0511', 'vitamin E 400mg 24cap', 'cat-solid', 'علبة', '14.00', '12.00', '20.00', '118.00', '12.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0512', 'thiotacid 600mg 30tab', 'cat-solid', 'علبة', '32.00', '28.00', '39.00', '31.00', '5.00', '2027-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0513', 'sanso b12 28tab', 'cat-solid', 'علبة', '21.00', '18.00', '30.00', '32.00', '5.00', '2027-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0514', 'dormival 20cap', 'cat-solid', 'علبة', '32.00', '30.00', '42.00', '45.00', '8.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0515', 'panadol cold and flu 24', 'cat-other', 'علبة', '13.00', '8.00', '20.00', '100.00', '12.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0516', 'panadol acute 20tab', 'cat-solid', 'علبة', '13.00', '13.00', '20.00', '39.00', '5.00', '2027-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0517', '1,2,3 20tab', 'cat-solid', 'علبة', '10.00', '8.00', '18.00', '78.00', '8.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0518', 'congestal 20tab', 'cat-solid', 'علبة', '9.00', '7.00', '14.00', '385.00', '20.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0519', 'neurovit 30tab', 'cat-solid', 'علبة', '14.00', '12.00', '21.00', '685.00', '20.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0520', 'ala 300mg 30cap', 'cat-solid', 'علبة', '50.00', '45.00', '60.00', '16.00', '3.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0521', 'conta flu 20tab', 'cat-solid', 'علبة', '13.00', '11.00', '20.00', '5.00', '2.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0522', 'antiflu 20cap', 'cat-solid', 'علبة', '9.00', '8.00', '20.00', '130.00', '12.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0523', 'clearest 14tab', 'cat-solid', 'علبة', '14.00', '12.00', '20.00', '15.00', '3.00', '2027-12-31', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0524', 'flurest n 20tab', 'cat-solid', 'علبة', '7.00', '6.00', '10.00', '1007.00', '20.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0525', 'panadol advance 48tab', 'cat-solid', 'علبة', '16.00', '12.00', '20.00', '184.00', '20.00', '2027-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0526', 'panadol 500mg 20tab', 'cat-solid', 'علبة', '8.00', '6.00', '10.00', '66.00', '8.00', '2027-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0527', 'trimed flu 30tab', 'cat-solid', 'علبة', '13.00', '11.00', '24.00', '150.00', '20.00', '2027-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0528', 'cystone 60tab', 'cat-solid', 'علبة', '16.00', '14.00', '10.00', '20.00', '5.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0529', 'limitless magnesium 150mg 30tab', 'cat-solid', 'علبة', '35.00', '32.00', '39.00', '3.00', '2.00', '2027-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0530', 'flu 20tab', 'cat-solid', 'علبة', '14.00', '12.00', '20.00', '64.00', '8.00', '2030-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0531', 'coldatrexy 30tab', 'cat-solid', 'علبة', '12.00', '10.00', '30.00', '194.00', '20.00', '2028-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0532', 'power cold and flu 20tab', 'cat-solid', 'علبة', '10.00', '8.00', '20.00', '270.00', '20.00', '2028-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0533', 'dimra 20tab', 'cat-solid', 'علبة', '12.00', '9.00', '20.00', '302.00', '20.00', '2027-11-03', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0534', 'myofen 30cap', 'cat-solid', 'علبة', '14.00', '12.00', '30.00', '79.00', '8.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0535', 'mark fast 30tab', 'cat-solid', 'علبة', '21.00', '17.00', '30.00', '10.00', '3.00', '2029-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0536', 'verserc 16mg 30tab', 'cat-solid', 'علبة', '20.00', '17.00', '24.00', '13.00', '3.00', '2028-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0537', 'flexilax 30tab', 'cat-solid', 'علبة', '18.00', '15.00', '30.00', '44.00', '8.00', '2028-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0538', 'telfast 180mg 20tab', 'cat-solid', 'علبة', '22.00', '20.00', '30.00', '33.00', '5.00', '2027-04-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0539', 'telfast 120mg 20tab', 'cat-solid', 'علبة', '19.00', '15.00', '26.00', '41.00', '8.00', '2027-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0540', 'bi profenid 150mg 20tab', 'cat-solid', 'علبة', '15.00', '12.00', '20.00', '140.00', '12.00', '2026-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0541', 'mepacofen 20tab', 'cat-solid', 'علبة', '9.00', '6.00', '14.00', '69.00', '8.00', '2026-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0542', 'balgesic 20tab', 'cat-solid', 'علبة', '18.00', '16.00', '24.00', '39.00', '5.00', '2030-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0543', 'norgesic 20tab', 'cat-solid', 'علبة', '7.00', '6.00', '10.00', '104.00', '12.00', '2027-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0544', 'protozole 500mg 12tab', 'cat-solid', 'علبة', '16.00', '14.00', '30.00', '44.00', '8.00', '2029-10-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0545', 'flamotal 800mg 10tab', 'cat-solid', 'علبة', '9.00', '7.00', '10.00', '299.00', '20.00', '2028-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0546', 'diclopro 150mg 20tab', 'cat-solid', 'علبة', '15.00', '12.00', '20.00', '160.00', '20.00', '2027-06-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0547', 'naredrix 6tab', 'cat-solid', 'علبة', '12.00', '10.00', '15.00', '50.00', '8.00', '2028-08-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0548', 'panadol migraine 30tab', 'cat-solid', 'علبة', '21.00', '18.00', '30.00', '39.00', '5.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0549', 'parofen 30tab', 'cat-solid', 'علبة', '12.00', '9.00', '30.00', '22.00', '5.00', '2028-11-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0550', 'sugarlo plus 50/1000mg 30tab', 'cat-solid', 'علبة', '27.00', '23.00', '36.00', '118.00', '12.00', '2028-07-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0551', 'sugarlo plus 50/850mg 30tab', 'cat-solid', 'علبة', '27.00', '23.00', '36.00', '42.00', '8.00', '2028-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0552', 'rivarospire 20mg 20tab', 'cat-solid', 'علبة', '9.00', '25.00', '50.00', '28.00', '5.00', '2028-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0553', 'vildagluse plus 50/1000mg 30tab', 'cat-solid', 'علبة', '35.00', '33.00', '45.00', '7.00', '2.00', '2028-02-28', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0554', 'danstro 4mg 10tab', 'cat-solid', 'علبة', '45.00', '33.00', '50.00', '74.00', '8.00', '2026-09-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0555', 'kirk multivitamin 180tab', 'cat-solid', 'علبة', '18.00', '14.00', '25.00', '60.00', '8.00', '2016-12-20', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0556', 'atrovastatin 20mg 10tab', 'cat-solid', 'علبة', '10.00', '7.00', '12.00', '18.00', '3.00', '2027-05-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0557', 'مبرد قدم', 'cat-other', 'علبة', '6.00', '4.00', '10.00', '5.00', '2.00', '2027-01-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0558', 'Alexamol 20tab', 'cat-solid', 'علبة', '20.00', '18.00', '20.00', '30.00', '5.00', '2027-03-30', NULL, 'المخزن الرئيسي', NULL),
('prd-wh-0559', 'Alexamol k 20tab', 'cat-solid', 'علبة', '20.00', '20.00', '30.00', '0.00', '2.00', '2027-03-30', NULL, 'المخزن الرئيسي', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `sales_invoices`
--

CREATE TABLE `sales_invoices` (
  `id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `invoice_number` int NOT NULL,
  `branch_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `seller_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `invoice_type` enum('paid','debt') COLLATE utf8mb4_unicode_ci NOT NULL,
  `total` decimal(10,2) NOT NULL,
  `profit` decimal(10,2) NOT NULL,
  `created_at` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sales_invoice_items`
--

CREATE TABLE `sales_invoice_items` (
  `id` bigint NOT NULL,
  `invoice_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_name` varchar(200) COLLATE utf8mb4_unicode_ci NOT NULL,
  `sale_type` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `quantity` decimal(10,2) NOT NULL,
  `sale_price` decimal(10,2) NOT NULL,
  `profit` decimal(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `settings`
--

CREATE TABLE `settings` (
  `id` tinyint NOT NULL DEFAULT '1',
  `pharmacy_name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `currency` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_sync_at` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `pending_operations` int NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `settings`
--

INSERT INTO `settings` (`id`, `pharmacy_name`, `currency`, `last_sync_at`, `pending_operations`) VALUES
(1, 'صيدلية محمد فارم', 'شيكل', NULL, 0);

-- --------------------------------------------------------

--
-- Table structure for table `stock_entries`
--

CREATE TABLE `stock_entries` (
  `id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `branch_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `unit` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `quantity` decimal(10,2) NOT NULL,
  `purchase_price` decimal(10,2) NOT NULL,
  `supplier_name` varchar(150) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `reference_number` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `notes` text COLLATE utf8mb4_unicode_ci,
  `created_at` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `username` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `role` enum('manager','stock','seller') COLLATE utf8mb4_unicode_ci NOT NULL,
  `branch_id` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `username`, `password`, `role`, `branch_id`) VALUES
('usr-admin', 'المدير العام', 'admin', 'Admin@123', 'manager', NULL),
('usr-seller-1', 'بائع فرع 1', 'seller1', 'Seller1@123', 'seller', 'br-001'),
('usr-seller-2', 'بائع فرع 2', 'seller2', 'Seller2@123', 'seller', 'br-002'),
('usr-seller-3', 'بائع فرع 3', 'seller3', 'Seller3@123', 'seller', 'br-003'),
('usr-stock-1', 'المخزن المركزي', 'stock1', 'Stock1@123', 'stock', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `branches`
--
ALTER TABLE `branches`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `debts`
--
ALTER TABLE `debts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_debts_invoice_id` (`invoice_id`),
  ADD KEY `idx_debts_branch_id` (`branch_id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_products_category_id` (`category_id`),
  ADD KEY `idx_products_branch_id` (`branch_id`);

--
-- Indexes for table `sales_invoices`
--
ALTER TABLE `sales_invoices`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_sales_invoices_invoice_number` (`invoice_number`),
  ADD KEY `idx_sales_invoices_branch_id` (`branch_id`),
  ADD KEY `idx_sales_invoices_seller_id` (`seller_id`);

--
-- Indexes for table `sales_invoice_items`
--
ALTER TABLE `sales_invoice_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_sales_invoice_items_invoice_id` (`invoice_id`),
  ADD KEY `idx_sales_invoice_items_product_id` (`product_id`);

--
-- Indexes for table `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `stock_entries`
--
ALTER TABLE `stock_entries`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_stock_entries_branch_id` (`branch_id`),
  ADD KEY `idx_stock_entries_product_id` (`product_id`),
  ADD KEY `idx_stock_entries_category_id` (`category_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_users_username` (`username`),
  ADD KEY `idx_users_branch_id` (`branch_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `sales_invoice_items`
--
ALTER TABLE `sales_invoice_items`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `debts`
--
ALTER TABLE `debts`
  ADD CONSTRAINT `fk_debts_branch_id` FOREIGN KEY (`branch_id`) REFERENCES `branches` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_debts_invoice_id` FOREIGN KEY (`invoice_id`) REFERENCES `sales_invoices` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE;

--
-- Constraints for table `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `fk_products_branch_id` FOREIGN KEY (`branch_id`) REFERENCES `branches` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_products_category_id` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE;

--
-- Constraints for table `sales_invoices`
--
ALTER TABLE `sales_invoices`
  ADD CONSTRAINT `fk_sales_invoices_branch_id` FOREIGN KEY (`branch_id`) REFERENCES `branches` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_sales_invoices_seller_id` FOREIGN KEY (`seller_id`) REFERENCES `users` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE;

--
-- Constraints for table `sales_invoice_items`
--
ALTER TABLE `sales_invoice_items`
  ADD CONSTRAINT `fk_sales_invoice_items_invoice_id` FOREIGN KEY (`invoice_id`) REFERENCES `sales_invoices` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_sales_invoice_items_product_id` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE;

--
-- Constraints for table `stock_entries`
--
ALTER TABLE `stock_entries`
  ADD CONSTRAINT `fk_stock_entries_branch_id` FOREIGN KEY (`branch_id`) REFERENCES `branches` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_stock_entries_category_id` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_stock_entries_product_id` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE;

--
-- Constraints for table `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `fk_users_branch_id` FOREIGN KEY (`branch_id`) REFERENCES `branches` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
